In [1]:
import sqlite3
import pandas as pd

In [2]:
import os

In [6]:
conn = sqlite3.connect(os.path.join(os.getcwd(), "chinook.db"))

In [7]:
chinook_df = pd.read_sql_query("SELECT * FROM customers;", conn, index_col='CustomerId')

In [8]:
chinook_df.head(2)

,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
CustomerId,,,,,,,,,,,,
1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
2,Leonie,Köhler,None,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,+49 0711 2842222,None,leonekohler@surfeu.de,5

### Задание 1

In [9]:
result_df = pd.read_sql_query(
    """
    SELECT CONCAT(LastName, ' ', LastName) AS Customer
    FROM customers
    """, conn
)
result_df.head()

                  Customer
0      Gonçalves Gonçalves
1            Köhler Köhler
2        Tremblay Tremblay
3            Hansen Hansen
4  Wichterlová Wichterlová

### Задание 2

In [10]:
result_df = pd.read_sql_query(
    """
    SELECT DISTINCT City
    FROM customers
    """, conn
)
result_df.head()

                  City
0  São José dos Campos
1            Stuttgart
2             Montréal
3                 Oslo
4               Prague

### Задание 3

In [11]:
result_df = pd.read_sql_query(
    """
    SELECT CONCAT(LastName, ' ', LastName) AS Customer, City
    FROM customers
    WHERE City LIKE 'A%'
    """, conn)
result_df.head()

                    Customer       City
0  Van der Berg Van der Berg  Amsterdam